---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizeIterator.GetCurrent
source: html/9685cd25-4b38-fc59-5acb-240d6e9f9ee2.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator.GetCurrent Method

Returns the current MEPSize.

## Syntax (C#)
```csharp
public MEPSize GetCurrent()
```

## Returns
The current MEPSize.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no current item in the iterator.